In [1]:

import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [2]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                    'k2':['alpha','beta','alpha','beta','alpha'],
                    'dataset1':np.random.randn(5),
                    'dataset2':np.random.randn(5)})

In [3]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  1.739392 -1.019161
1  X   beta -0.988763 -0.604900
2  Y  alpha  0.001468  0.515458
3  Y   beta -0.283713 -0.040421
4  Z  alpha -1.170425  1.290016

In [4]:
group1 = dframe['dataset1'].groupby(dframe['k1'])

In [5]:
group1

In [6]:
group1.mean()

k1
X    0.375314
Y   -0.141123
Z   -1.170425
Name: dataset1, dtype: float64

In [7]:
cities = np.array(['NY','LA','LA','NY','NY'])
month = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [9]:
dframe['dataset1'].groupby([cities,month]).mean()

LA  FEB   -0.988763
    JAN    0.001468
NY  FEB   -0.283713
    JAN    0.284484
Name: dataset1, dtype: float64

In [10]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  1.739392 -1.019161
1  X   beta -0.988763 -0.604900
2  Y  alpha  0.001468  0.515458
3  Y   beta -0.283713 -0.040421
4  Z  alpha -1.170425  1.290016

In [11]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X   0.375314 -0.812031
Y  -0.141123  0.237518
Z  -1.170425  1.290016

In [12]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha  1.739392 -1.019161
   beta  -0.988763 -0.604900
Y  alpha  0.001468  0.515458
   beta  -0.283713 -0.040421
Z  alpha -1.170425  1.290016

In [13]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [21]:
for name,group in dframe.groupby('k1'):
    print "This is the %s group %name"
    print group
    print '\n'

SyntaxError: Missing parentheses in call to 'print'. Did you mean print("This is the %s group %name")? (<ipython-input-21-cc3d549062ab>, line 2)

In [22]:
# We can also iterate over groups

#For example:
for name,group in dframe.groupby('k1'):
    print "This is the %s group" %name
    print group
    print '\n'

SyntaxError: Missing parentheses in call to 'print'. Did you mean print("This is the %s group" %name)? (<ipython-input-22-bfbe46681b05>, line 5)

In [23]:
for (k1,k2) , group in dframe.groupby(['k1','k2']):
    print "Key1 = %s Key2 = %s" %(k1,k2)
    print group
    print '\n'

SyntaxError: invalid syntax (<ipython-input-23-7b1b137e8c99>, line 2)

In [24]:
group_dict = dict(list(dframe.groupby('k1')))

In [25]:
group_dict['X']

  k1     k2  dataset1  dataset2
0  X  alpha  1.739392 -1.019161
1  X   beta -0.988763 -0.604900

In [26]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes,axis=1)))

In [27]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0  1.739392 -1.019161
 1 -0.988763 -0.604900
 2  0.001468  0.515458
 3 -0.283713 -0.040421
 4 -1.170425  1.290016,
 dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [28]:
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]

In [29]:
dataset2_group.mean()

          dataset2
k1 k2
X  alpha -1.019161
   beta  -0.604900
Y  alpha  0.515458
   beta  -0.040421
Z  alpha  1.290016